1. Series: 由一组数据（各种NumPy数据类型）以及一组与之相关的数据标签（即索引）组成。

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
obj1 = pd.Series([4,5,6,7]) #仅由一组数据即可产生最简单的Series
obj1

0    4
1    5
2    6
3    7
dtype: int64

In [3]:
obj1.index=['Bob', 'Steve', 'Jeff', 'Ryan'] #Series的索引可以通过赋值的方式就地修改
obj1

Bob      4
Steve    5
Jeff     6
Ryan     7
dtype: int64

In [4]:
obj2 = pd.Series([4,5,6,7],index=['d','b','a','c'])
obj2

d    4
b    5
a    6
c    7
dtype: int64

In [5]:
obj2['d']

4

In [6]:
obj2[['c','a','d']] #索引列表

c    7
a    6
d    4
dtype: int64

<1>使用NumPy函数或类似NumPy的运算:

In [7]:
obj2[obj2 > 5]

a    6
c    7
dtype: int64

In [8]:
obj2 * 2

d     8
b    10
a    12
c    14
dtype: int64

In [9]:
np.exp(obj2)

d      54.598150
b     148.413159
a     403.428793
c    1096.633158
dtype: float64

In [10]:
'b' in obj2

True

<2>用字典创建Series

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata) #如果只传入一个字典，则结果Series中的索引就是原字典的键
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [12]:
states = ['California', 'Ohio', 'Oregon', 'Texas'] #传入排好序的字典的键以改变顺序
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

<3>检测缺失数据:

In [13]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [14]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [15]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

<4>根据运算的索引标签自动对齐数据：(类似database join的操作)

In [16]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

<5>Series对象本身及其索引都有一个name属性

In [19]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

<6>values属性

In [20]:
obj4.values

array([   nan, 35000., 16000., 71000.])

In [21]:
obj4.values.shape

(4,)

2. DataFrame是一个表格型的数据结构，它含有一组有序的列，每列可以是不同的值类型（数值、字符串、布尔值等）。
DataFrame既有行索引也有列索引，它可以被看做由Series组成的字典（共用同一个索引）。
DataFrame中的数据是以一个或多个二维块存放的（而不是列表、字典或别的一维数据结构）。

<1>建DataFrame的办法有很多，最常用的一种是直接传入一个由等长列表或NumPy数组组成的字典：

In [22]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], \
        'year': [2000, 2001, 2002, 2001, 2002, 2003], \
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
frame.head() #选取前五行

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
pd.DataFrame(data, columns=['year','state','pop']) # 如果指定了列序列，则DataFrame的列就会按照指定顺序进行排列

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [25]:
#如果传入的列在数据中找不到，就会在结果中产生缺失值
frame2 = pd.DataFrame(data, \
             columns=['year', 'state', 'pop', 'debt'], \
             index=['one', 'two', 'three', 'four', 'five', 'six']) 
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [26]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

<2>通过类似字典标记的方式或属性的方式，可以将DataFrame的列获取为一个Series:
frame2[column]适用于任何列的名，但是frame2.column只有在列名是一个合理的Python变量名时才适用。

通过索引方式返回的列只是相应数据的视图而已，并不是副本。因此，对返回的Series所做的任何就地修改全都会反映到源DataFrame上。
通过Series的copy方法即可指定复制列。

In [27]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [28]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [29]:
frame2.loc['three'] #行也可以通过位置或名称的方式进行获取

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

<3>列可以通过赋值的方式进行修改
将列表或数组赋值给某个列时，其长度必须跟DataFrame的长度相匹配.
如果赋值的是一个Series，就会精确匹配DataFrame的索引，所有的空位都将被填上缺失值.

In [30]:
frame2.debt = 16.5  # or frame2['debt'] = 16.5  # 给那个空的"debt"列赋上一个标量值
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [31]:
frame2.debt = np.arange(6.0) # 给那个空的"debt"列赋上一组值：
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [32]:
val = pd.Series([-1.2, -1.5, -1.7], index=('two', 'four', 'five'))
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

<4>建新列 \ 删除列

In [33]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [34]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

<5>另一种常见的数据形式是嵌套字典
如果嵌套字典传给DataFrame，pandas就会被解释为：外层字典的键作为列，内层键则作为行索引.

In [35]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, \
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}} #内层字典的键会被合并、排序以形成最终的索引
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [36]:
frame3.T #DataFrame进行转置

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

<6>由Series组成的字典

In [37]:
pdata = {'Ohio': frame3['Ohio'][:-1], \
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

<7>如果设置了DataFrame的index和columns的name属性，则这些信息也会被显示出来

In [38]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

<7>values属性

In [39]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [40]:
frame2.values  #如果DataFrame各列的数据类型不同，则值数组的dtype就会选用能兼容所有列的数据类型

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [50]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [49]:
frame3.T.index

Index(['Nevada', 'Ohio'], dtype='object', name='state')

3. 索引对象
pandas的索引对象负责管理轴标签和其他元数据（比如轴名称等）。
构建Series或DataFrame时，所用到的任何数组或其他序列的标签都会被转换成一个Index：

In [56]:
obj = pd.Series(range(3),index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [57]:
#Index对象是不可变的，因此用户不能对其进行修改
#eg: index[1] = 'd'
#不可变可以使Index对象在多个数据结构之间安全共享
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [58]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [59]:
obj2.index is labels

True

与python的集合不同，pandas的Index可以包含重复的标签.选择重复的标签，会显示所有的结果。